{"id":"5e7c8230-d2e3-11ec-acd2-6f3f7d0169c8","updated_at":"2022-05-17T17:50:27.358Z","updated_by":"elastic","created_at":"2022-05-13T17:37:33.476Z","created_by":"elastic","name":"Suspicious Windows ANONYMOUS Local Account Created","tags":["Windows","Sigma","elastic-content-share"],"interval":"5m","enabled":true,"description":"Detects the creation of suspicious accounts similar to ANONYMOUS LOGON, such as using additional spaces. Created as an covering detection for exclusion of Logon Type 3 from ANONYMOUS LOGON accounts.","risk_score":75,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"25m"},"author":["https://elastic-content-share.eu","James Pemberton / @4A616D6573"],"false_positives":["Unknown"],"from":"now-1800s","rule_id":"1bbf25b9-8038-4154-a50b-118f2a32be27","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence","id":"TA0003"},"technique":[{"reference":"https://attack.mitre.org/techniques/T1136","name":"Create Account","id":"T1136","subtechnique":[]},{"reference":"https://attack.mitre.org/techniques/T1136/001","name":"Local Account","id":"T1136.001","subtechnique":[]},{"reference":"https://attack.mitre.org/techniques/T1136/002","name":"Domain Account","id":"T1136.002","subtechnique":[]}]}],"to":"now","references":["https://twitter.com/SBousseaden/status/1189469425482829824"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["winlogbeat*"],"query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4720\" AND winlog.event_data.SamAccountName.keyword:*ANONYMOUS* AND winlog.event_data.SamAccountName.keyword:*LOGON*)","filters":[],"throttle":"no_actions","actions":[]}
{"id":"089dca70-d317-11ec-acd2-6f3f7d0169c8","updated_at":"2022-05-14T14:06:11.126Z","updated_by":"elastic","created_at":"2022-05-13T23:47:22.399Z","created_by":"elastic","name":"APT29","tags":["attack.t1086"],"interval":"5m","enabled":true,"description":"This method detects a suspicious powershell command line combination as used by APT29 in a campaign against US think tanks","risk_score":95,"severity":"critical","license":"","output_index":".siem-signals-default","meta":{"from":"30m","kibana_siem_app_url":"http://10.50.64.4:5601/app/security"},"author":[],"false_positives":[],"from":"now-2100s","rule_id":"c10b95f2-e688-45e8-8865-67c73443c952","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution","id":"TA0002"},"technique":[{"reference":"https://attack.mitre.org/techniques/T1059","name":"Command and Scripting Interpreter","id":"T1059","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1059/001","name":"PowerShell","id":"T1059.001"}]}]}],"to":"now","references":["https://cloudblogs.microsoft.com/microsoftsecure/2018/12/03/analysis-of-cyberattack-on-u-s-think-tanks-non-profits-public-sector-by-unidentified-attackers/"],"version":3,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["winlogbeat*"],"query":"(winlog.event_data.ScriptBlockText.keyword : *-noni* and winlog.event_data.ScriptBlockText.keyword : *-ep* and winlog.event_data.ScriptBlockText.keyword : *bypass* and winlog.event_data.ScriptBlockText.keyword : *$*) or (winlog.event_data.CommandLine.keyword : *-noni* and winlog.event_data.CommandLine.keyword : *-ep* and winlog.event_data.CommandLine.keyword : *bypass* and winlog.event_data.CommandLine.keyword : *$*) or (winlog.event_data.ParentCommandLine.keyword : *-noni* and winlog.event_data.ParentCommandLine.keyword : *-ep* and winlog.event_data.ParentCommandLine.keyword : *bypass* and winlog.event_data.ParentCommandLine.keyword : *$*)","filters":[],"throttle":"no_actions","actions":[]}
{"id":"fc512ce0-d39c-11ec-acd2-6f3f7d0169c8","updated_at":"2022-05-14T16:06:23.536Z","updated_by":"elastic","created_at":"2022-05-14T15:46:14.943Z","created_by":"elastic","name":"Hight number of logon failure ","tags":["attack.credential_access","attack.t1110"],"interval":"5m","enabled":true,"description":"Detects many authentication failures from one source which may indicate Brute Force activity.","risk_score":47,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"35m","kibana_siem_app_url":"http://10.50.64.4:5601/app/security"},"author":[],"false_positives":["Inventarization","Vulnerability scanner","Legitimate application or user"],"from":"now-2400s","rule_id":"cbb870a7-4081-4c10-b93b-f4d69ffacb12","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1110","name":"Brute Force","subtechnique":[],"id":"T1110"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access","id":"TA0006"}}],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["winlogbeat*"],"query":"event.code : 4625","filters":[],"threshold":{"field":["winlog.event_data.TargetUserName.keyword"],"value":3,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"f3206b40-d2e3-11ec-acd2-6f3f7d0169c8","updated_at":"2022-05-13T17:49:39.657Z","updated_by":"elastic","created_at":"2022-05-13T17:41:43.142Z","created_by":"elastic","name":"Successful Overpass the Hash Attempt","tags":["Windows","Sigma","elastic-content-share"],"interval":"5m","enabled":true,"description":"Detects successful logon with logon type 9 (NewCredentials) which matches the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.","risk_score":75,"severity":"high","note":"","output_index":".siem-signals-default","author":["https://elastic-content-share.eu","Roberto Rodriguez (source), Dominik Schaudel (rule)"],"false_positives":["Runas command-line tool using /netonly parameter"],"from":"now-15m","rule_id":"192a0330-c20b-4356-90b6-7b7049ae0b87","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"","name":"t1075","id":"t1075"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement","id":"TA0008"}}],"to":"now","references":["https://cyberwardog.blogspot.de/2017/04/chronicles-of-threat-hunter-hunting-for.html"],"version":2,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["winlogbeat*"],"query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"9\" AND winlog.event_data.LogonProcessName:\"seclogo\" AND winlog.event_data.AuthenticationPackageName:\"Negotiate\")","throttle":"no_actions","actions":[]}
{"id":"7b1b9e90-d31e-11ec-acd2-6f3f7d0169c8","updated_at":"2022-05-14T00:40:43.966Z","updated_by":"elastic","created_at":"2022-05-14T00:40:41.909Z","created_by":"elastic","name":"Advanced IP Scanner","tags":["attack.discovery","attack.t1046"],"interval":"5m","enabled":true,"description":"Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups.","risk_score":47,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"40m","kibana_siem_app_url":"http://10.50.64.4:5601/app/security"},"author":[],"false_positives":["Legitimate administrative use."],"from":"now-2700s","rule_id":"81424afd-3fc1-43bf-8c05-7c27ade4f5df","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"technique":[{"id":"T1046","reference":"https://attack.mitre.org/techniques/T1046","name":"Network Service Scanning","subtechnique":[]}]}],"to":"now","references":["https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/","https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html","https://labs.f-secure.com/blog/prelude-to-ransomware-systembc","https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf","https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["winlogbeat*"],"query":"winlog.event_data.Image: \"*\\AppData\\Local\\Temp\\Advanced Ip Scanner\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"bcf67f80-d2fe-11ec-acd2-6f3f7d0169c8","updated_at":"2022-05-17T22:08:33.271Z","updated_by":"elastic","created_at":"2022-05-13T20:53:28.031Z","created_by":"elastic","name":"Mimikatz Use","tags":["Windows","Sigma","elastic-content-share","attack.s0002","attack.lateral_movement","attack.credential_access","car.2013-07-001","car.2019-04-004","attack.t1003.002","attack.t1003.004","attack.t1003.001","attack.t1003.006"],"interval":"5m","enabled":true,"description":"This method detects mimikatz keywords in different Eventlogs (some of them only appear in older Mimikatz version that are however still used by different threat groups)","risk_score":100,"severity":"critical","license":"","output_index":".siem-signals-default","meta":{"from":"30m","kibana_siem_app_url":"http://10.50.64.4:5601/app/security"},"author":["https://elastic-content-share.eu","Florian Roth"],"false_positives":["Naughty administrators","Penetration test","Files with Mimikatz in their filename"],"from":"now-2100s","rule_id":"06d71506-7beb-4f22-8888-e2e5e2ca7fd8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK","technique":[{"id":"T1003","reference":"https://attack.mitre.org/techniques/T1003","name":"OS Credential Dumping","subtechnique":[{"id":"T1003.004","reference":"https://attack.mitre.org/techniques/T1003/004","name":"LSA Secrets"},{"id":"T1003.001","reference":"https://attack.mitre.org/techniques/T1003/001","name":"LSASS Memory"},{"id":"T1003.006","reference":"https://attack.mitre.org/techniques/T1003/006","name":"DCSync"},{"id":"T1003.002","reference":"https://attack.mitre.org/techniques/T1003/002","name":"Security Account Manager"}]}]},{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK","technique":[]}],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["winlogbeat*"],"query":"(\\*.keyword:(*dpapi\\:\\:masterkey* OR *eo.oe.kiwi* OR *event\\:\\:clear* OR *event\\:\\:drop* OR *gentilkiwi.com* OR *kerberos\\:\\:golden* OR *kerberos\\:\\:ptc* OR *kerberos\\:\\:ptt* OR *kerberos\\:\\:tgt* OR *Kiwi Legit Printer* OR *lsadump\\:\\:* OR *mimidrv.sys* OR *mimilib.dll* OR *misc\\:\\:printnightmare* OR *misc\\:\\:shadowcopies* OR *misc\\:\\:skeleton* OR *privilege\\:\\:backup* OR *privilege\\:\\:debug* OR *privilege\\:\\:driver* OR *sekurlsa\\:\\:*) AND (NOT (winlog.event_id:\"15\")))","filters":[],"throttle":"no_actions","actions":[]}
